# -*- mode: ruby; -*-
tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"

# Build essentials
brew "coreutils"
brew "findutils"
brew "texinfo"

# for Treemacs
brew "python3"

brew "cmigemo"

brew "ripgrep"

# for org-download
brew "pngpaste"

# for dirvish
brew "eza"

# for emacs-libvterm
brew "cmake"
brew "libtool"

# for doc-view
brew "mupdf-tools" # mutool
cask "libreoffice" # soffice

# for man
brew "man-db"

# fonts
cask "font-noto-sans-symbols-2"
cask "font-ibm-plex-sans-jp"

cask "font-moralerspace"
cask "font-moralerspace-jpdoc"
cask "font-moralerspace-nf"

cask "font-moralerspace-hw"
cask "font-moralerspace-hw-jpdoc"
cask "font-moralerspace-hw-nf"

brew "emacs-plus@30", args: %w{with-ctags with-no-frame-refocus with-xwidgets with-imagemagick with-native-comp}
